RADIUS = 20 # расстояние до точки при котором она считается собранной

BUTTON1 = "🌲 Информация"
BUTTON2 = "🧭 Маршруты"
BUTTON3 = "👤 Профиль"
BUTTON4 = "💵 Оплата"
BUTTON5 = "💻 Админ панель"

BUTTON6 = "🔙 Вернуться в меню"
BUTTON7 = "🎯 Сбросить прогресс"

BUTTON8 = "Создать маршрут"
BUTTON9 = "Статистика"
BUTTON10 = "Удалить маршрут"
BUTTON11 = ""
BUTTON12 = ""

CB_BUTTON1 = "С описанием"
CB_BUTTON2 = "Со сбором геоточек"
CB_BUTTON3 = "✅ Да"
CB_BUTTON4 = ""
CB_BUTTON5 = ""


TEXT1 = "Не понимаю вас, пожалуйста используйте кнопки"
TEXT2 = "Вы авторизовались как админ"
TEXT3 = "Добро пожаловать. Для управления используйте кнопки ниже"
TEXT4 = ""
TEXT5 = ""
TEXT6 = ""
TEXT7 = ""
