RADIUS = 20 # расстояние в метрах до точки при котором она считается собранной

BUTTON1 = "🌲 Информация"
BUTTON2 = "🧭 Маршруты"
BUTTON3 = "👤 Профиль"
BUTTON4 = "Рейтинг"
BUTTON5 = "💻 Админ панель"

BUTTON6 = "🔙 Вернуться в меню"
BUTTON7 = "🎯 Сбросить прогресс"

BUTTON8 = "Создать маршрут"
BUTTON9 = "Статистика"
BUTTON10 = "Удалить маршрут"


CB_BUTTON1 = "С описанием"
CB_BUTTON2 = "Со сбором геоточек"
CB_BUTTON3 = "✅ Да"
CB_BUTTON4 = "Нет"
CB_BUTTON5 = "📍 Проверить мою геопозицию"


TEXT1 = "Не понимаю вас, пожалуйста используйте кнопки"
TEXT2 = "Вы авторизовались как админ"
TEXT3 = "Добро пожаловать. Для управления используйте кнопки ниже"
TEXT4 = "Маршрут какого типа вы хотите пройти?"
TEXT5_1 = "Доступные маршруты:"
TEXT5_2 = "Пришлите номер того, который выберете"
TEXT6 = "Описание маршрута:"
TEXT7 = "Вы должны прислать номер маршрута"
TEXT8 = "Теперь, чтобы начать выбранный маршрут, пришлите трансляцию геопозиции"
TEXT9 = "Маршрут создан и записан в базу данных"
TEXT10 = "Хорошо, теперь геоточку номер"
TEXT11_1 = "Пользователь"
TEXT11_2 = "начал онлайн маршрут №"
TEXT12 = "Вы должны прийти в точку №1:"
TEXT13 = "Оставшееся расстояние до точки в метрах:"
TEXT14 = 'Вы уже отправили локацию, чтобы начать заново нажмите "Сбросить прогресс"'
TEXT15 = "🎉 Поздравляем, вы прошли маршрут!"
TEXT16_1 = "Вы достигли точки №"
TEXT16_2 = ", следующая точка №"
TEXT17 = "Уверены что хотите сбросить выбор маршрута и весь прогресс по нему?"
TEXT18 = "Сбросил в исходное состояние"
TEXT19 = "Не сбрасываю прогресс"
TEXT20 = "Возвращаюсь в меню"
TEXT21 = "Рейтинга пока нет"
TEXT22 = "Что вы хотите сделать?"
TEXT23 = "Маршрут какого типа вы хотите создать?"
TEXT24 = "Маршрут какого типа хотите удалить?"
TEXT25 = "Введите номер маршрута который хотите удалить"
TEXT7 = ""
TEXT7 = ""
TEXT7 = ""
TEXT7 = ""
TEXT7 = ""
TEXT7 = ""
TEXT7 = ""
TEXT7 = ""

# чего нибудь позитивного
# атмосфера загадочности