RADIUS = 20 # расстояние в метрах до точки при котором она считается собранной

BUTTON1 = "🌲 Информация"
BUTTON2 = "🧭 Маршруты"
BUTTON3 = "👤 Профиль"
BUTTON4 = "Рейтинг"
BUTTON5 = "💻 Админ панель"

BUTTON6 = "🔙 Вернуться в меню"
BUTTON7 = "🎯 Сбросить прогресс"

BUTTON8 = "Создать маршрут"
BUTTON9 = "Статистика"
BUTTON10 = "Удалить маршрут"


CB_BUTTON1 = "С описанием"
CB_BUTTON2 = "Со сбором геоточек"
CB_BUTTON3 = "✅ Да"
CB_BUTTON4 = "Нет"
CB_BUTTON5 = "📍 Проверить мою геопозицию"


TEXT1 = "Не понимаю вас, пожалуйста используйте кнопки"
TEXT2 = "Вы авторизовались как админ"
TEXT3 = "Добро пожаловать. Для управления используйте кнопки ниже"
TEXT4 = "Маршрут какого типа вы хотите пройти?"
TEXT5_1 = "Доступные маршруты:"
TEXT5_2 = "Пришлите номер того, который выберете"
TEXT6 = "Описание маршрута:"
TEXT7 = "Вы должны прислать номер маршрута"
TEXT8 = "Теперь, чтобы начать выбранный маршрут, пришлите трансляцию геопозиции"
TEXT9 = "Маршрут создан и записан в базу данных"
TEXT10 = "Хорошо, теперь геоточку номер"
TEXT11_1 = "Пользователь"
TEXT11_2 = "начал онлайн маршрут №"
TEXT12 = "Вы должны прийти в точку №1:"
TEXT13 = "Оставшееся расстояние до точки в метрах:"
TEXT14 = 'Вы уже отправили локацию, чтобы начать заново нажмите "Сбросить прогресс"'
TEXT15 = "🎉 Поздравляем, вы прошли маршрут!"
TEXT16_1 = "Вы достигли точки №"
TEXT16_2 = ", следующая точка №"
TEXT17 = "Уверены что хотите сбросить выбор маршрута и весь прогресс по нему?"
TEXT18 = "Сбросил в исходное состояние"
TEXT19 = "Не сбрасываю прогресс"
TEXT20 = "Возвращаюсь в меню"
TEXT21 = "Рейтинга пока нет"
TEXT22 = "Что вы хотите сделать?"
TEXT23 = "Маршрут какого типа вы хотите создать?"
TEXT24 = "Маршрут какого типа хотите удалить?"
TEXT25 = "Введите номер маршрута который хотите удалить"
TEXT26 = ("С помощью этого бота вы можете проходить различные маршруты. "
          "Присутствует два режима: с описанием и со сбором геоточек.\n"
          "В первом вам выдаётся описание маршрута. \nВо втором вы должны прийти в геоточку, отправленную ботом, "
          "и нажать на кнопку проверить мою геопозицию. Если вы находитесь в правильном месте, вам выдастся следующая геоточка."
          "Также для сбора геоточек есть несколько рекомендаций, которые могут вам помочь:\n"
          '1. Не начинайте маршрут с зарядом менее 30%\n'
          "2. Трансляцию геопозиции вы отправляете один раз для одного маршрута, удалять или присылать новую в процессе "
          "прохождения не нужно. \n3.Расстояние до следующей точки в сообщении отправленном ботом обновляется в процессе прохождения "
          'при нажатии на кнопку "проверить моё местоположение".\n'
          '4. Также оставшееся расстояние можно смотреть на карте при нажатии на геоточку.\n'
          '5. На карте можно сменить слой на спутниковый.')
TEXT = ""


# чего нибудь позитивного
# атмосфера загадочности